//计算利息
//例2：用C语言计算存款利息。假设有本金1000元，想存一年，有三种方法可选择：
//活期，年利率为0.0036；
//一年期定期，年利率为0.0225；
//存两次半年定期，年利率为0.0198。

//#include <stdio.h>
//
//int main()
//{
//	double money = 1000,bx;
//
//	//活期
//	double hl= 0.0036;
//	bx = money * (1 + hl);
//	printf("活期，年利率为0.0036一年后所得到的本息:%f\n", bx);
//
//	//一年期定期
//	double yl = 0.0225;
//	bx = money * (1 + yl);
//	printf("一年期定期，年利率为0.0225一年后所得到的本息:%f\n", bx);
//
//	//存两次半年定期
//	double bl = 0.0192;
//	bx = money * (1 + bl / 2) * (1 + bl / 2);
//	printf("存两次半年定期，年利率为0.0198一年后所得到的本息:%f\n", bx);
//
//	return 0;
//}
