//由小到大排序

//例4：任意输入3个整数,编程实现对这3个整数由小到大进行排序，并将排序后的结果显示在屏幕上。

//#include <stdio.h>
//
//int main()
//{
//	//int a = 432, b = 34, c = 65, d = 0;//先用固定的数写代码
//	int a, b, c, d = 0;
//	scanf_s("%d%d%d", &a, &b, &c);//输入任意数
//
//	if (a > b)//第一次判断a是否大于b，大于则交换使得a最小
//	{
//		d = a;
//		a = b;
//		b = d; 
//	}
//	//printf("%d,%d", a, b);//查看交换结果
//	if (a > c)//第二次判断a是否大于c，大于则交换使得a最小
//	{
//		d = a;
//		a = c;
//		c = d;
//	}
//	//printf("%d,%d", a, c);//查看交换结果
//	if (b > c)//第三次判断b是否大于c，大于则交换使得b最小
//	{
//		d = c;
//		c = b;
//		b = d;
//	}
//	//printf("%d,%d", b, c);//查看交换结果
//
//	printf("%d < %d < %d\n", a, b, c);//排序后的结果
//	
//	return 0;
//}